performance.yml
config:
  target: "https://api.todoist.com"
  phases:
    - duration: 3
      arrivalRate: 1
      name: "Phase 1"
  defaults:
    headers:
      Authorization:  Bearer {{ $processEnvironment.TOKEN }}
      Content-type:   application/json
  scenarios:
    - flow:
        - get:
            url: "/rest/v1/projects"
        - post:
            url: "/rest/v1/projects"
            json:
              name: "Demo"
            capture:
              json: "$.id"
              as: "id"
        - log: "Current id is {{ id }}"